---
title: HomeCamera
classe: Autodesk.Revit.DB.HomeCamera
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# HomeCamera

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double BottomAngleOfFieldOfView { get; }` | `homeCamera.BottomAngleOfFieldOfView` | Double |
| `XYZ Center { get; }` | `homeCamera.Center` | XYZ |
| `XYZ EyePosition { get; }` | `homeCamera.EyePosition` | XYZ |
| `Boolean IsValidObject { get; }` | `homeCamera.IsValidObject` | Boolean |
| `Double LeftAngleOfFieldOfView { get; }` | `homeCamera.LeftAngleOfFieldOfView` | Double |
| `Double OrthogonalProjectionHeight { get; }` | `homeCamera.OrthogonalProjectionHeight` | Double |
| `Double OrthogonalProjectionWidth { get; }` | `homeCamera.OrthogonalProjectionWidth` | Double |
| `XYZ Pivot { get; }` | `homeCamera.Pivot` | XYZ |
| `Double RightAngleOfFieldOfView { get; }` | `homeCamera.RightAngleOfFieldOfView` | Double |
| `Double TopAngleOfFieldOfView { get; }` | `homeCamera.TopAngleOfFieldOfView` | Double |
| `XYZ UpDirection { get; }` | `homeCamera.UpDirection` | XYZ |
| `ElementId ViewId { get; }` | `homeCamera.ViewId` | ElementId |
| `Void Dispose()` | `homeCamera.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```